In [1]:
import pandas as pd
import numpy as np

In [2]:
dias = pd.date_range(start='20190101', periods=12)

In [3]:
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [4]:
Pessoa = ['George', 'Victor', 'Lucas']

In [9]:
np.random.choice(Pessoa)

'George'

In [16]:
Nome = []
Gasto = []
for i in range(12):
    Nome.append(np.random.choice(Pessoa))
    Gasto.append(np.round(np.random.rand()*100,2))
Nome

['Lucas',
 'Lucas',
 'George',
 'Lucas',
 'Lucas',
 'Victor',
 'Lucas',
 'Lucas',
 'George',
 'George',
 'Victor',
 'George']

In [17]:
Gasto

[54.89,
 11.48,
 9.38,
 52.78,
 41.99,
 19.94,
 43.44,
 47.04,
 6.88,
 79.5,
 0.86,
 10.66]

In [18]:
df = pd.DataFrame({'Dias': dias, 'Nome': Nome, 'Gasto': Gasto})

In [19]:
df

         Dias    Nome  Gasto
0  2019-01-01   Lucas  54.89
1  2019-01-02   Lucas  11.48
2  2019-01-03  George   9.38
3  2019-01-04   Lucas  52.78
4  2019-01-05   Lucas  41.99
5  2019-01-06  Victor  19.94
6  2019-01-07   Lucas  43.44
7  2019-01-08   Lucas  47.04
8  2019-01-09  George   6.88
9  2019-01-10  George  79.50
10 2019-01-11  Victor   0.86
11 2019-01-12  George  10.66

In [22]:
df.pivot(index='Dias', columns='Nome', values='Gasto')

Nome        George  Lucas  Victor
Dias
2019-01-01     NaN  54.89     NaN
2019-01-02     NaN  11.48     NaN
2019-01-03    9.38    NaN     NaN
2019-01-04     NaN  52.78     NaN
2019-01-05     NaN  41.99     NaN
2019-01-06     NaN    NaN   19.94
2019-01-07     NaN  43.44     NaN
2019-01-08     NaN  47.04     NaN
2019-01-09    6.88    NaN     NaN
2019-01-10   79.50    NaN     NaN
2019-01-11     NaN    NaN    0.86
2019-01-12   10.66    NaN     NaN